//Conditions\\

//Дараах 6 бодлогыг Javascript энгийн operation болон condition үйлдлүүдийг ашиглан бодлогуудыг бодож гүйцэтгэнэ үү.\\

// let a = 4
// let b = 6
// if (a > b){console.log(" ih too - ", a)} else {console.log ("ih too -", b)}
// 3 tonii ihiig ol \\
//let a = 1;
//let b = 2;
//let c = 3;
//if (a > b) {
//if (b > c) {
//onsole.log("ih too -", c);
//} else {
//console.log(" ih too -", b);
//}
//} else {
//if (a > c) {
//console.log("ih too -", a);
//} else {
//console.log("ih too -", c);
//}
//}

//Бодлого 1\\
//А болон В тоо өгөгдсөн бол ихийг нь ол. А болон В тоо өгөгдсөн бол жиших үйлдэл хийлгүйгээр ихийг нь ол.\\
//let a = 6;
//let b = 2;
//let max;
//max = ( ( a + b ) + Math.abs( a - b ) ) / 2;
//console.log(max);

//Бодлого 2\\
//А болон В тоо өгөгдсөн бол ихийг нь ол. А болон В тоо өгөгдсөн бол жиших үйлдэл хийж ихийг нь ол.\\
// let a = 4
// let b = 6
// if (a > b){console.log(" ih too - ", a)} else {console.log ("ih too -", b)}

//Бодлого 3\\
//4 тооны ихээсээ 2 дахь тоог ол.\\
// let a = 0;
// let b = 101;
// let c = 66;
// let d = 0;
// let max = 0;
// if (a > b) {
//   max = a;
// } else {
//   max = b;
// }
// if (max > c) {
// } else {
//   max = c;
// }
// if (max > d) {
//   max = d;
// }
// console.log(max);

//Бодлого 4\\
//4 тооны 0-ээс их тоонуудын нийлбэр, 0-тэй тэнцүү тоонуудын тоолж, 0-ээс бага тоонуудыг үржвэрийг ол.\\
//let a = 2;
//let b = 1;
//let c = 0;
//let d = -1;
//let sum = 0;
//let con = 0;
//let max = 0;
//if (a > 0) {
//sum = sum + a;
//}
//if (b > 0) {
//sum = sum + b;
//}
//if (c > 0) {
//sum = sum + c;
//}
//if (d > 0) {
//sum = sum + d;
//}
//if (a == 0) {
//con = con + 1;
//}
//if (b == 0) {
//con = con + 1;
//}
//if (c == 0) {
//con = con + 1;
//}
//if (d == 0) {
//con = con + 1;
//}
//if (a > 0) {
//max = max * a;
//}
//if (b > 0) {
//max = max * b;
//}
//if (c > 0) {
//max = max * c;
//}
//if (d > 0) {
//max = max * d;
//}
//console.log(sum, con, max);

//Бодлого 5\\
//Тоог тэгш сондгой эсэхийг нь тодорхойлох.\\
//let a = 1;
//let b = 2;
//let c = 3;
//let d = 4;
//let sum = 0;
//let max = 0;
//if (a / 2) {
//sum = sum + 1;
//}
//if (b / 2) {
//sum = sum + 1;
//}
//if (c / 2) {
//sum = sum + 1;
//}
//if (d / 2) {
//sum = sum + 1;
//}
//if (0 == a % 2) {
//max = max + 1;
//}
//if (0 == b % 2) {
//max = max + 1;
//}
//if (0 == c % 2) {
//max = max + 1;
//}
//if (0 == d % 2) {
//max = max + 1;
//}
//console.log(sum, max);



//Home work\\

//Бодлого 1\\
//Өгөгдсөн А он нь өндөр жил мөн үү.  Өндөр жил гэдэг нь 4-т хуваагддаг, 100   хуваагддаггүй, 400 жилд хуваагддаг жилийг хэлдэг.\\



//Бодлого 2\\
//1-100 хүртэлх тоонуудын нийлбэрийг ол.\\



//Бодлого 3\\
//Шатрын хөлгийн 2 буудал координатын цэгүүд өгөгдсөн бол ижил өнгөтэй эсэхийг нь ол. Хэрвээ тийм бол `Yes`, үгүй бол `No` гэж хэвлэнэ.\\



//Бодлого 4\\
//N нас өгөгдвөл тухайн хүнийг аль ангилалд хамрах гэдгийг олно уу.\\



//Бодлого 5\\
//ATM машины code ийг бичицгээе. Тоон дүн оруулахад “20000”, “10000”, “5000”, “1000”, “500” ийн дэвсгэртүүдийг ашиглан тоон дүнд харгалзах мөнгийг буцаа.\\
// Жишээ: \\
// 43500 -> 2 ш “20000”, 3 ш “1000”, 1 ш “500”\\
// 28000 ->1 ш “20000”, 1 ш “5000”, 3 ш “1000”\\


