//Дасгал - While loop\\

//Бодлого 1\\
// 1 ees 1000 murtelh tegsh tonudiin niilberiig ol \\

// let sum = 0;
// let a = 0;
// while (a < 1000) {
//   a = a + 1;
//   if (a % 2 == 0) {
//     sum = sum + a;
//   }
// }

// console.log(sum);

//Бодлого 2\\
//a, b тооны ХИЕХ-ийг ол. ХИЕХ гэдэг нь a,b тоог хоёуланг нь хувааж чаддаг хамгийн их тоо юм.\\

// let a = 06;
// let d = 09;
// let c = a;
// let max = 0;
// while (max == 0) {
//   if (a % c == 0 && d % c == 0) {
//     max = c;
//   } else {
//     c = c - 1;
//   }
// }
// console.log(max);

//Дасгал - Do While loop\\

//Бодлого 1\\
// 100-1 хүртэл хэвлэх програмын алдааг олж зөв болгон ажиллуул.\\

// let n = 100;
// let i = 1;
// do {
//     n--
//     console.log(n);
// }while (i < n);

//Бодлого 2\\
//Доорх код нь ямар утга хэвлэх вэ?\\

// let x = 0;
// do {
//   console.log(x);
//   x = 1;
// } while (x < 0);
// console.log(x);
// 0, 1

//Дасгал - For loop\\

//Бодлого 1\\
// Дараах кодыг өөрчлөн 0-10 биш 10-0 хүртэл тоог хэвлэдэг болго.\\

// for (i = 10; i > -1; i = i - 1) {
//     console.log(i)
// }

//Бодлого 2\\
// 1 - 100 хүртэлх тоонуудын нийлбэрийг ол.\\

// let sum = 0;
// for (i = 1; i < 101; i++) {
//   sum = sum + i;
//   console.log(sum);
// }

//Дасгал - any loop\\
//Дараах 6 бодлогыг Javascript хэлээр дээр үзсэн давталтуудыг ашиглан бодож гүйцэтгэнэ үү. (Аль тохирох давталтыг өөрөө сонгоно)\\

//Бодлого 1\\
//N тооны бүх хуваагчдыг ол.\\
//Жишээ n тоо  (220, 113, 78)\\

// let n = 240;
// let a = 0;
// let b;
// while (a <= n) {
//   if (n % a == 0) {
//     b = n / a;
//     console.log(b);
//     a = a + 1;
//   } else {
//     a = a + 1;
//   }
// }

//Бодлого 2\\
//Өгөгдсөн тоо палиндром эсэхийг шалга. Хэрэв мөн бол тийм гэж хэвлэ, үгүй бол үгүй гэж хэвлэ.\\
// Палиндром тоо гэдэг нь урдаасаа ч хойноосоо ч бичсэн ижил тоог хэлнэ.
// Жишээ 1:
// Input: 1221 Output: тийм
// Жишээ 2:
// Input: 133 Output: үгүй

// let a = 1221
// let b = 0
// let c = a
// let sum = 0
// while(a > 0){
//     b = a % 10
//     sum = sum * 10 + b
//     a = parseInt(a / 10)
// }
// if (sum == c){
//     console.log("Tiim")
// }else{
//     console.log("Ugui")
// }

//Бодлого 3\\
//3 + 6 + 9 + … + 999 хүртэлх тоонуудын нийлбэрийг ол\\

// let sum = 0
// for ( a = 3; a < 1002; a = a + 3){
//     sum = sum + a
//     console.log(sum)
// }

//Бодлого 4\\
//3-37 хүртэлх тоонуудаас 5д хуваагддаг тоонуудыг хэвлэ.\\

// let sum = 0;
// let a = 3;
// while (a < 37) {
//   a = a + 1;
//   if (a % 5 == 0) {
//     sum = sum + a;
//     console.log(sum)
//   }
// }

//Бодлого 5\\
//Өгөгдсөн тооны цифрүүдийн нийлбэрийг олно уу.\\
// Жишээ 1:
// Input: 4019
// Output: 4 + 0 + 1 + 9 = 14
// Жишээ 2:
// Input: 123
// Output: 1+2+3 = 6

// let a = 397
// let b = 0
// let sum = 0
// while(a > 0){
//     b = a % 10
//     sum = sum + b
//     a = parseInt(a / 10)
// }
// console.log(sum)

//Бодлого 6\\
//Өгөгдсөн тооны хүрдийг дараах хэлбэрээр гарга.\\
// Input : 3
// Output:
// 	3*1=3
// 	3*2=6
// 	3*3=9
// 	……
// 	3*10=30

// let sum = 0
// for ( a = 3; a < 30; a = a + 3){
//     console.log(a)
// }

//Дасгал - Nested loop\\
//Дараах 3 бодлогыг Javascript давхар давталтыг ашиглан дараах хэлбэр бүхий одыг хэвлэнэ үү.\\

//Бодлого 1 - Дөрвөлжин 1\\
// * * * * *
// * * * * *
// * * * * *
// * * * * *
// * * * * *

// let txt = "";
// for (let j = 0; j < 5; j++) {
//   for (let i = 0; i < 5; i++) {
//     txt = txt + "* ";
//   }
//   txt = txt + "\n"
// }
// console.log(txt);

// let text = "";
// for (let j = 0; j < 3; j++) {
//   for (let i = 0; i < 3; i++) {
//     text = text + "* ";
//   }
//   text = text + "\n";
// }
// console.log(text);

//Бодлого 2 - Дөрвөлжин 2\\
// * * + * *
// * * + * *
// * * + * *
// * * + * *
// * * + * *

// let txt = "";
// for (let j = 0; j < 5; j++) {
//   for (let i = 0; i < 5; i++) {
//     if (i == 2) {
//       txt = txt + "+ ";
//     } else {
//       txt = txt + "* ";
//     }
//   }
//   txt = txt + "\n";
// }
// console.log(txt);

//Бодлого 3 - Дөрвөлжин 3\\
//2-оос илүү хувьсагч хэрэглэхгүй.
// * * * * *
// * * * * *
// * * + * *
// * * * * *
// * * * * *

// let txt = "";
// for (let j = 0; j < 5; j++) {
//   for (let i = 0; i < 5; i++) {
//     if (j == 2) {
//       if (i == 2) {
//         txt = txt + "+ ";
//       } else {
//         txt = txt + "* ";
//       }
//     } else {
//       txt = txt + "* ";
//     }
//   }
//   txt = txt + "\n";
// }
// console.log(txt);

//Бодлого 4 - Гурвалжин 1\\
// *
// * *
// * * *
// * * * *
// * * * * *

let txt = "";
for (let j = 0; j < 5; j++) {
  for (let i = 0; i < 5; i++) {
    txt = txt + "* ";
  }
  txt = txt + "\n";
}
console.log(txt);

//Бодлого 5 - Гурвалжин 2\\
// * * * * *
//   * * * *
//     * * *
//       * *
//         *

//Бодлого 6 - Пирамид 1\\
//     *
//    * *
//   * * *
//  * * * *
// * * * * *

//Бодлого 7 - Тоо 1\\
// 1
// 1 2
// 1 2 3
// 1 2 3 4
// 1 2 3 4 5

//Бодлого 8 - Тоо 2\\
// 1
// 2 3
// 4 5 6
// 7 8 9 10
